 import React from 'react'
 
 const instruction ={
   ru:{
    titleRu:'Инструкция',
    'rules1':<div>
        Итак, правила!
        <br></br>
        Цель игры - прогресс.
        <br></br>
        Что это значит?
        <br></br>
        Достижение максимальной прибыли в минимальный промежуток времени. 
        <br></br>
        Как измеряется этот показатель? (далее - прибыль)
        <br></br>
        Количество игровой валюты ("Голда"), которое игрок заработал за одну минуту. В счет идет чистая прибыль.
        <br></br>
        Важно понимать, что общее число голды, по сути, не приносит никакого статуса. Ибо игрок может  реализовывать продукцию с одной единственной коровы
        <br></br> и накопить таким образом некоторое количество голды. Но рейтинг такого игрока будет гораздо ниже того, кто заработает меньше голды, 
        <br></br>
        но за пару минут.
        </div>,
     'rules2':<div>
            Игрок видит два статуса прибыли. 
        <br></br>
        1.Прибыль\мин - последний замереный показатель. 
        <br></br>
        2.Лучший показатель - соответсвенно рекорд.
        <br></br>
        Прибыль\мин - получется когда игрок жмет на кнопку "декларировать". Интервал времени для получения показателя
        <br></br>
        берется между двумя нажатиями. 
        <br></br>
        К примеру Игрок задекларировал (после оплаты налога!) 100 голды. Спустя 90 секунд задекларировал 400. 
        <br></br>
        Соответсвенно чистая прибыль получается 300 голды за 90 секунд. (3.33\сек) Умножаем на 60 - переводим в минуты - получаем 200 голды\мин
        <br></br>
        Кнопка "Декларировать" является не только триггером к посчету дохода. Это простой способ уплаты игрового налога. Который составляет на старте - 12%
        <br></br>
        С точки зрения игровой механики налог - это ограничивающий момент на сброс интервала времени. 
        <br></br>
        Выходит, чем грамотне и продуманее  у игрока развернуто хозяйство - тем выше у него будут показтели прибыли.
        <br></br>
        Налог прогрессивный: чем выше ваш статус и чем больше земли - тем выше налог.
     </div>,
     'rules3':<div>
          Игрок зарабатывает реализовывая игровую продукцию. Это - молоко и яйца (разработчик аутист, поэтому они зовутся в игре "милк" и "ики" )
         <br></br>
         Производители продукции соответсвено - "мухрю" и "чикены" (прививки виноваты?)
         <br></br>
          Чикены и Мухрю производят продукцию только когда покормлены.
          <br></br>
          Одна единица еды обеспечивает чикен на 30 секунд нОски. Непрокачанная курица несется раз в 10 секунд.
          <br></br>
          Сытая мухрю дает молоко раз в 20 секунд. Еды ей хватает на 20 секунд.
          <br></br>
          Единица еды обеспечивается пшеницей(рош) раз в 10 секунд. Бесконечно. Но не более одной единицей за жатву. Когда урожай собран - рост возобновляется
          <br></br>
          <br></br>
            Чикены, мухрю и рош покупаются за игровую валюту. Чикенов и мухрю можно продать. Рош - нет. Так как попробуйте продать посеяные семена.
            <br></br>
            Покупка осуществляется перетаскиванием изображения из левой стороны эерана на игровой поле (изначально полей 9)
            <br></br>
            Поля также можно продавать и покупать.
     </div>,
     'rules4':<div>
         Прокаченный чикен несет ико на одну секунду быстрее.
         <br></br>
         Прокаченный мухрю дает на 2 надоя больше за 20 секунд.
         <br></br>
         Максимально прокаченный чикен дает 3 ика за 7 секунд.
         <br></br>
         Максимально прокачанный мухрю дает 5 милка за 20 секунд.
         <br></br>
         Прокачиваются животные автоматически. 
         <br></br>
         Когда чикен снесет 100 ик
         <br></br>
         Когда Мухрю даст 30 милка.
         <br></br>
         Можно купить добавки в корм
         <br></br>
         Добавка сокращает время производства ик и милка на 1 секунду
         <br></br>
         Добавка суммируется с прокачкой
         <br></br>
     </div>
   }
        
}

export {instruction}
 